{
  "project": "Ballade Song Catalog CMS",
  "branchName": "ralph/payload-cms-song-catalog",
  "description": "Migrate song catalog from hardcoded data to Payload CMS with database-backed storage and admin interface",
  "userStories": [
    {
      "id": "US-001",
      "title": "Install and configure Payload CMS",
      "description": "As a developer, I need Payload CMS installed as a Next.js plugin so that I can build the admin interface.",
      "acceptanceCriteria": [
        "Install payload, @payloadcms/next, @payloadcms/db-postgres, @payloadcms/richtext-lexical",
        "Create payload.config.ts at project root with PostgreSQL/Neon connection",
        "Configure Payload to use existing DATABASE_URL environment variable",
        "Add Payload admin route at /admin via Next.js catch-all route",
        "Admin panel loads at http://localhost:3000/admin",
        "Create initial admin user via Payload's setup flow",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-002",
      "title": "Create lookup collections for metadata",
      "description": "As a developer, I need lookup collections for reusable metadata so that songs can reference shared values.",
      "acceptanceCriteria": [
        "Create Countries collection with fields: name (text, required, unique)",
        "Create Languages collection with fields: name (text, required, unique), code (text, required, unique)",
        "Create Genres collection with fields: name (text, required, unique)",
        "Create Audiences collection with fields: name (text, required, unique)",
        "Create Themes collection with fields: name (text, required, unique)",
        "Each collection has admin UI with list view showing all entries",
        "Typecheck passes"
      ],
      "priority": 2,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-003",
      "title": "Create Songs collection with basic fields",
      "description": "As a developer, I need the core Songs collection with basic fields and metadata relationships.",
      "acceptanceCriteria": [
        "Create Songs collection with fields: title (text, required), slug (text, required, unique), thumbnailPublicId (text), difficulty (select: Facile|Intermédiaire|Difficile, required)",
        "Add relationship fields (many-to-many): countries, languages, genres, audiences, themes",
        "Slug auto-generates from title on create using Payload hook",
        "Slug is editable after creation",
        "Admin list view shows title, slug, difficulty",
        "Typecheck passes"
      ],
      "priority": 3,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-004",
      "title": "Add lyrics and translations arrays to Songs",
      "description": "As a content editor, I want to add multiple lyrics and translations in different languages to a song.",
      "acceptanceCriteria": [
        "Add lyrics array field to Songs with sub-fields: language (relationship to Languages, required), text (textarea, required)",
        "Add translations array field to Songs with sub-fields: language (relationship to Languages, required), text (textarea, required)",
        "Admin UI shows inline array editing with Add Lyric / Add Translation buttons",
        "Each array item shows language name as row label",
        "Typecheck passes",
        "Verify in browser using dev-browser skill (admin UI)"
      ],
      "priority": 4,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-005",
      "title": "Add music sheets and history documents to Songs",
      "description": "As a content editor, I want to upload PDF documents for music sheets and history per language.",
      "acceptanceCriteria": [
        "Add musicSheets array field to Songs with sub-fields: language (relationship to Languages, required), pdfPublicId (text, required)",
        "Add historyDocuments array field to Songs with sub-fields: language (relationship to Languages, required), pdfPublicId (text, required)",
        "Admin UI shows inline array editing",
        "Typecheck passes"
      ],
      "priority": 5,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-006",
      "title": "Add audio tracks with versions to Songs",
      "description": "As a content editor, I want to add audio tracks (groupe, violon, chant, guitare, percussion) with multiple versions per track.",
      "acceptanceCriteria": [
        "Add audioTracks array field to Songs with sub-fields: trackType (select: groupe|violon|chant|guitare|percussion, required), versions array with sub-fields: versionId (text, required), name (text, required), audioPublicId (text, required)",
        "Admin UI shows nested structure: track type dropdown, then versions list",
        "Add Version button within each track",
        "Typecheck passes",
        "Verify in browser using dev-browser skill (admin UI)"
      ],
      "priority": 6,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-007",
      "title": "Create Cloudinary upload field for thumbnails",
      "description": "As a content editor, I want to upload thumbnail images directly to Cloudinary from the admin.",
      "acceptanceCriteria": [
        "Create custom Cloudinary upload field component for Payload admin",
        "Upload thumbnails to folder structure: /songs/{slug}/thumbnails/",
        "Field displays upload button and current public_id",
        "After upload, stores Cloudinary public_id in database",
        "Thumbnail field shows image preview after upload",
        "Typecheck passes",
        "Verify in browser using dev-browser skill (upload flow)"
      ],
      "priority": 7,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-008",
      "title": "Create Cloudinary upload fields for PDFs and audio",
      "description": "As a content editor, I want to upload PDF and audio files directly to Cloudinary from the admin.",
      "acceptanceCriteria": [
        "Extend Cloudinary upload component to support PDF and audio file types",
        "Upload sheets to /songs/{slug}/sheets/, history to /songs/{slug}/history/",
        "Upload audio to /songs/{slug}/audio/{track-type}/",
        "PDF fields show filename/link after upload",
        "Audio fields show filename and playable preview after upload",
        "Typecheck passes",
        "Verify in browser using dev-browser skill (upload flow)"
      ],
      "priority": 8,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-009",
      "title": "Create API route to list songs with filtering",
      "description": "As a frontend developer, I need an API endpoint to fetch all songs with optional metadata filters.",
      "acceptanceCriteria": [
        "Create GET /api/songs route",
        "Returns array of songs with shape matching existing Song interface",
        "Support query parameters for filtering: country, language, genre, audience, theme, difficulty",
        "Multiple filters combine with AND logic",
        "Transforms Payload data to match Song interface including nested metadata object",
        "Response includes Cloudinary URLs built from public_ids",
        "Typecheck passes"
      ],
      "priority": 9,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-010",
      "title": "Create API route to get single song by slug",
      "description": "As a frontend developer, I need an API endpoint to fetch a single song with all related data.",
      "acceptanceCriteria": [
        "Create GET /api/songs/[slug] route",
        "Returns single song object matching Song interface",
        "Returns 404 if song not found",
        "Includes all nested data: lyrics, translations, musicSheets, history, audioTracks",
        "Transforms relationship IDs to full objects with language names/codes",
        "Builds full Cloudinary URLs from public_ids",
        "Typecheck passes"
      ],
      "priority": 10,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-011",
      "title": "Create API route for audio file URLs",
      "description": "As a frontend developer, I need an API endpoint to get the streaming URL for a specific audio track version.",
      "acceptanceCriteria": [
        "Create GET /api/songs/[slug]/audio/[trackType]/[versionId] route",
        "Returns JSON with Cloudinary streaming URL for the audio file",
        "Returns 404 if song, track type, or version not found",
        "URL is suitable for audio element src attribute",
        "Typecheck passes"
      ],
      "priority": 11,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-012",
      "title": "Create API route for lookup values",
      "description": "As a frontend developer, I need endpoints to fetch available lookup values for filter dropdowns.",
      "acceptanceCriteria": [
        "Create GET /api/lookup/[type] route where type is: countries, languages, genres, audiences, themes",
        "Returns array of objects with id and name (and code for languages)",
        "Results sorted alphabetically by name",
        "Returns 400 for invalid lookup type",
        "Typecheck passes"
      ],
      "priority": 12,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-013",
      "title": "Seed lookup tables with existing data",
      "description": "As a developer, I need to populate lookup tables with values from the existing hardcoded songs.",
      "acceptanceCriteria": [
        "Create seed script at scripts/seed-lookups.ts",
        "Extract unique values from lib/mockData.ts: Countries (France, Italie), Languages with codes, Genres, Audiences, Themes",
        "Script uses Payload Local API to create entries",
        "Script is idempotent (skips existing entries)",
        "Add npm script: db:seed: npx tsx scripts/seed-lookups.ts",
        "Typecheck passes"
      ],
      "priority": 13,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-014",
      "title": "Migrate existing songs to database",
      "description": "As a developer, I need to import the 3 existing songs from hardcoded data to the database.",
      "acceptanceCriteria": [
        "Create migration script at scripts/migrate-songs.ts",
        "Script reads songs from lib/mockData.ts and creates Payload documents",
        "Creates relationships to lookup tables for countries, languages, genres, audiences, themes",
        "Creates lyrics and translations arrays with language references",
        "Creates music sheets and history with placeholder public_ids like songs/{slug}/sheets/score",
        "Creates audio tracks with versions using placeholder public_ids like songs/{slug}/audio/{track}/{versionId}",
        "Script is idempotent (skips songs with existing slug)",
        "Add npm script: db:migrate-songs: npx tsx scripts/migrate-songs.ts",
        "After running, 3 songs visible in Payload admin",
        "Typecheck passes"
      ],
      "priority": 14,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-015",
      "title": "Create songs data store with API fetch",
      "description": "As a developer, I need a Zustand store to fetch songs from the API.",
      "acceptanceCriteria": [
        "Create store at store/useSongsDataStore.ts",
        "Add state: songs: Song[], currentSong: Song | null, isLoading: boolean, error: string | null",
        "Add actions: fetchSongs(filters?) calls GET /api/songs, fetchSongBySlug(slug) calls GET /api/songs/[slug], getAudioUrl(slug, trackType, versionId) calls audio API",
        "Keep existing useSongStore for UI state (selectedTabs, audio playback, etc)",
        "Typecheck passes"
      ],
      "priority": 15,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-016",
      "title": "Update pages to use API data store",
      "description": "As a developer, I need to update page components to fetch from the API instead of hardcoded data.",
      "acceptanceCriteria": [
        "Update pages/index.tsx (or app equivalent) to use useSongsDataStore for song list",
        "Update song detail page to use useSongsDataStore for song data",
        "Remove import of lib/mockData.ts from page components",
        "Loading and error states handled in UI",
        "Typecheck passes",
        "Verify in browser using dev-browser skill (song list and song detail pages)"
      ],
      "priority": 16,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-017",
      "title": "Add admin UI polish for song management",
      "description": "As a content editor, I want an intuitive admin experience for managing songs.",
      "acceptanceCriteria": [
        "Songs list view shows: title, slug, thumbnail preview, difficulty",
        "Songs list is searchable by title and sortable by title, created date",
        "Song edit form has logical field grouping: Basic Info, Metadata, Content, Documents, Audio sections",
        "Collapsible sections for content/documents/audio",
        "Helpful field descriptions/placeholders",
        "Typecheck passes",
        "Verify in browser using dev-browser skill (admin song form)"
      ],
      "priority": 17,
      "passes": false,
      "notes": ""
    }
  ]
}
